# Uaktualnianie indeksu

In [8]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [2]:
obj = pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

## reindex - uaktualnianie indeksu
zmiana kolejnosci danych  i przystosowanie do nowego indeksu

In [3]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

przy szeregach czasowych - moze bedzie trzeba uzyc opcji z metody *ffill*; wypelnia warto≈õci do przodu

In [4]:
obj3 = pd.Series(['blue','purple','yellow'],index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [5]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

w przypadku DataFrame - zmiana kolejnosci wierszy indeksu, kolumn lub obu tych elementow

In [11]:
# np.arange - z biblioteki numpy wykorzystanie; wypelnia od 1 do 9 w 3 kolumny i 3 wiersze
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                      index = ['a','b','c'],
                      columns = ['Ohio','Texas','California']
                      )
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [14]:
frame_t = pd.DataFrame(np.arange(16).reshape((4,4)),
                      index = ['a','b','c','d'],
                      columns = ['Ohio','Texas','California','aaa']
                      )
frame_t

   Ohio  Texas  California  aaa
a     0      1           2    3
b     4      5           6    7
c     8      9          10   11
d    12     13          14   15

In [15]:
frame2 = frame.reindex(['a','d','b','c'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
d   NaN    NaN         NaN
b   3.0    4.0         5.0
c   6.0    7.0         8.0

In [16]:
# uaktualnienie kolumn
states = ['Texas','Utah','California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8